Обработки/Reports/_РасчетДоходностиДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиДУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьФизЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СравнитьСПериодом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДляСравнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьСРасшифровкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БиржевыеИндексы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиБиржевыхИндексов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлановойДоходности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСЧАБезПослаблений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправленияСЧАБезПослаблений</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпискиДоговоров</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСпискаДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиДУ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Отчет.ВидПлановойДоходности = "" Тогда
		Отчет.ВидПлановойДоходности = "Нейтральная";
	КонецЕсли;
	
	Элементы.УровеньРасшифровки.СписокВыбора.Добавить("СчетДоверительногоУправления", "Счет внутреннего учёта");
	Элементы.УровеньРасшифровки.СписокВыбора.Добавить("ВидДоговораДоверительногоУправления", "Вид договора доверительного управления");
	Элементы.УровеньРасшифровки.СписокВыбора.Добавить("Клиент", "Клиент");
	Элементы.УровеньРасшифровки.СписокВыбора.Добавить("Стратегия", "Стратегия"); 
	
	СинхронизироватьВидыДоговоровДоверительногоУправления();
	
	Если ПустаяСтрока(Отчет.УровеньРасшифровки) Тогда
		Отчет.УровеньРасшифровки = "СчетДоверительногоУправления";
	КонецЕсли;
	
	ЗаполнитьВариантыОтчетов();
	
	НастройкаВидимостиИДоступности(ЭтаФорма); 
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьВидыДоговоровДоверительногоУправления()
	Для Каждого ЗначениеПеречисления из Перечисления.ВидыДоговоровДоверительногоУправления Цикл 
		Если Отчет.ВидыДоговоровДоверительногоУправления.НайтиПоЗначению(ЗначениеПеречисления) = Неопределено Тогда
			Отчет.ВидыДоговоровДоверительногоУправления.Добавить(ЗначениеПеречисления,, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Отчет.ВидыДоговоровДоверительногоУправления.СортироватьПоПредставлению();
	
	Для Каждого ЗначениеПеречисления из Перечисления.ВидыДоговоровДоверительногоУправления Цикл 
		Если Отчет.ВидыДоговоровДоверительногоУправленияСЧАБезПослаблений.НайтиПоЗначению(ЗначениеПеречисления) = Неопределено
			И ЗначениеПеречисления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
			Отчет.ВидыДоговоровДоверительногоУправленияСЧАБезПослаблений.Добавить(ЗначениеПеречисления,, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Отчет.ВидыДоговоровДоверительногоУправленияСЧАБезПослаблений.СортироватьПоПредставлению();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Отчет.ГруппировкиОтчета.НайтиПоЗначению("Управляющий") = Неопределено Тогда
		Отчет.ГруппировкиОтчета.Добавить("Управляющий", "Управляющий", Истина);
	КонецЕсли;
	
	Если Отчет.ГруппировкиОтчета.НайтиПоЗначению("ВидДоговораДоверительногоУправления") = Неопределено Тогда
		Отчет.ГруппировкиОтчета.Добавить("ВидДоговораДоверительногоУправления", "Вид договора доверительного управления", Истина);
	КонецЕсли;
	
	Если Отчет.ГруппировкиОтчета.НайтиПоЗначению("Клиент") = Неопределено Тогда
		Отчет.ГруппировкиОтчета.Добавить("Клиент", "Клиент", Истина);
	КонецЕсли;
	
	СинхронизироватьВидыДоговоровДоверительногоУправления();
	
	ОбновитьСписокВыбораПреддставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
	
	НастройкаВидимостиИДоступности(ЭтаФорма); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыОтчетов()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Для Каждого Макет Из ОтчетОбъект.Метаданные().Макеты Цикл
		Если Макет.Имя <> "СкриншотФормы" И Макет.Имя <> "ОписаниеИндексов" Тогда
			Элементы.ВариантОтчета.СписокВыбора.Добавить(Макет.Имя, Макет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	Элементы.ФормаКомандаПоказатьНастройки.Пометка = НЕ Элементы.ФормаКомандаПоказатьНастройки.Пометка;
	
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
		Если ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.БиржевыеИндексы") Тогда
			Для Каждого Значение Из ВыбранноеЗначение Цикл
				НоваяСтрокаНастроек = Отчет.НастройкиБиржевыхИндексов.Добавить();
				НоваяСтрокаНастроек.БиржевойИндекс = Значение;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.НастройкиРасчета") Тогда
			Настройки = ПолучитьДанныеНастроек(ВыбранноеЗначение);
			Для Каждого Настройка Из Настройки Цикл
				ЗаполнитьЗначенияСвойств(Отчет.НастройкиБиржевыхИндексов.Добавить(), Настройка);
			КонецЦикла;
		КонецЕсли;
		
		СвернутьТаблицуНастройкиБиржевыхИндексов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНастроек(МассивНастроек)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиРасчетаСоставляющие.Ссылка КАК НастройкаРасчета,
		|	НастройкиРасчетаСоставляющие.БазаРасчета КАК БазаРасчета,
		|	НастройкиРасчетаСоставляющие.ПараметрыРасчета КАК ПараметрыРасчета
		|ИЗ
		|	Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
		|ГДЕ
		|	НастройкиРасчетаСоставляющие.Ссылка В(&МассивНастроек)
		|	И НастройкиРасчетаСоставляющие.БазаРасчета В (ЗНАЧЕНИЕ(Справочник.БазыРасчета.БиржевойИндекс))";
	
	Запрос.УстановитьПараметр("МассивНастроек", МассивНастроек);
	
	НастройкиРасчета = Запрос.Выполнить().Выгрузить();

	МассивНастроек = Новый Массив;
	
	Для Каждого НастройкаРасчета Из НастройкиРасчета Цикл
		Настройка = Новый Структура("БазаРасчета,БиржевойИндекс,Среднеарифметическое,КоличествоЗначений,ВалютаКонвертации");
		
		ЗаполнитьЗначенияСвойств(Настройка, НастройкаРасчета);
		
		Если Настройка.БазаРасчета = Справочники.БазыРасчета.БиржевойИндекс Тогда
			ПараметрыРасчета = Настройка.ПараметрыРасчета.Получить();
			
			Настройка.Вставить("БиржевойИндекс",		ПараметрыРасчета.ПараметрРасчетаБиржевойИндекс);
			Настройка.Вставить("Среднеарифметическое",  ПараметрыРасчета.ПараметрСреднеарифметическое);
			Настройка.Вставить("КоличествоЗначений", 	ПараметрыРасчета.ПараметрКоличествоЗначений);
			Настройка.Вставить("ВалютаКонвертации",  	ПараметрыРасчета.ПараметрРасчетаВалютаКонвертации);
			
		КонецЕсли;

		МассивНастроек.Добавить(Настройка);
		
	КонецЦикла;
	
	Возврат МассивНастроек;
	
КонецФункции

&НаСервере
Процедура СвернутьТаблицуНастройкиБиржевыхИндексов()
	
	НастройкиБиржевыхИндексов = Отчет.НастройкиБиржевыхИндексов.Выгрузить();
	НастройкиБиржевыхИндексов.Свернуть("БазаРасчета,БиржевойИндекс,Среднеарифметическое,КоличествоЗначений,ВалютаКонвертации");
	
	Отчет.НастройкиБиржевыхИндексов.Загрузить(НастройкиБиржевыхИндексов);
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаПодборБиржевойИндекс(Команда)
	
	ОткрытьФорму("Справочник.БиржевыеИндексы.ФормаВыбора", Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборНастройкиРасчета(Команда)
	ОткрытьФорму("Справочник.НастройкиРасчета.ФормаВыбора", Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина), ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкаВидимостиИДоступности(Форма)
	Элементы = Форма.Элементы;
	Отчет = Форма.Отчет;
	
	Элементы.ГруппаНастройкиДоходности.Видимость = (Отчет.ВариантОтчета <> "ДоходностьИндексов");
	Элементы.ГруппаНастройкиБиржевыхИндексов.Видимость = (Отчет.ВариантОтчета = "ДоходностьИндексов");
	Элементы.ПредыдущаяДата.Видимость = (Отчет.ВариантОтчета = "РасчетДоходностиДУСокращенная");
	Элементы.ГруппаСравнениеСПериодом.Видимость =
		(Отчет.ВариантОтчета <> "РасчетДоходностиДУСокращенная"
			И Отчет.ВариантОтчета <> "ОбязательстваПередКлиентами"
			И Отчет.ВариантОтчета <> "ПрогнозируемаяДоходность");
	Элементы.ГруппировкиОтчета.Видимость =
		(Отчет.ВариантОтчета = "РасчетДоходностиДУ"
			Или Отчет.ВариантОтчета = "РасчетДоходностиДУСокращенная"
			Или Отчет.ВариантОтчета = "ПрогнозируемаяДоходность"
			Или Отчет.ВариантОтчета = "ВознагражденияУК");
	Элементы.ВидВалюты.Видимость = (Отчет.ВариантОтчета <> "ВознагражденияУК");
	Элементы.ГруппаПечатьСРасшифровкой.Видимость =
		(Отчет.ВариантОтчета = "РасчетДоходностиДУ"
			Или Отчет.ВариантОтчета = "РасчетДоходностиДУСокращенная");
	Элементы.ВидПлановойДоходности.Видимость = (Отчет.ВариантОтчета = "ПрогнозируемаяДоходность");
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаКомандаПоказатьНастройки.Пометка;
	Элементы.ФормаКомандаВыгрузитьВРиски.Видимость =
		(Отчет.ВариантОтчета = "РасчетДоходностиДУ"
			Или Отчет.ВариантОтчета = "ОбязательстваПередКлиентами");
	
	// Отборы
	ОтображатьОтборы = (Отчет.ВариантОтчета <> "ДоходностьИндексов");
	ОтображатьОтборыПоДоговорам = ОтображатьОтборы И Отчет.ОтборПоДоговорам;
	
	Элементы.ОтборПоДоговорам.Видимость = ОтображатьОтборы;
	Элементы.ГруппаСписокДоговоров.Видимость = ОтображатьОтборыПоДоговорам;
	Элементы.ВидыДоговоровДоверительногоУправления.Видимость = Не ОтображатьОтборыПоДоговорам;
	Элементы.ВидыДоговоровДоверительногоУправленияСЧАБезПослаблений.Видимость = Не ОтображатьОтборыПоДоговорам И Отчет.РассчитыватьСЧАБезПослаблений;
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	НастройкаВидимостиИДоступности(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДоговорамПриИзменении(Элемент)

	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьСЧАПоПисьмуЦБПриИзменении(Элемент)
	
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДобавить(Команда)
	
	ПараметрыОткрытия = Новый Структура("ПредставлениеСписка,СписокДоговоров", "", Новый СписокЗначений);
	
	ПараметрыВыбора = ОткрытьФормуМодально("ВнешнийОтчет._РасчетДоходностиДУ.Форма.РедактированиеСпискаДоговоров", ПараметрыОткрытия, ЭтаФорма);
	
	Если ПараметрыВыбора <> Неопределено Тогда
		ДобавленныйЭлемент = Отчет.СпискиДоговоров.Добавить(ПараметрыВыбора.СписокДоговоров, ПараметрыВыбора.ПредставлениеСписка); 
		
		ОбновитьСписокВыбораПреддставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
	
		Отчет.ИдентификаторСпискаДоговоров = ДобавленныйЭлемент.ПолучитьИдентификатор();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровРедактировать(Команда)
	
	НайденныйЭлемент = Отчет.СпискиДоговоров.НайтиПоИдентификатору(Отчет.ИдентификаторСпискаДоговоров);
	
	Если НайденныйЭлемент <> Неопределено Тогда
	
		ПараметрыОткрытия = Новый Структура("ПредставлениеСписка,СписокДоговоров", НайденныйЭлемент.Представление, НайденныйЭлемент.Значение);
		
		ПараметрыВыбора = ОткрытьФормуМодально("ВнешнийОтчет._РасчетДоходностиДУ.Форма.РедактированиеСпискаДоговоров", ПараметрыОткрытия, ЭтаФорма);
		
		Если ПараметрыВыбора <> Неопределено Тогда
			НайденныйЭлемент.Значение		= ПараметрыВыбора.СписокДоговоров;
			НайденныйЭлемент.Представление	= ПараметрыВыбора.ПредставлениеСписка;
			
			ОбновитьСписокВыбораПреддставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровУдалить(Команда)
	
	ВыбранныйЭлемент = Отчет.СпискиДоговоров.ВыбратьЭлемент("Удалить список договоров", Отчет.СпискиДоговоров.НайтиПоИдентификатору(Отчет.ИдентификаторСпискаДоговоров));
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Отчет.СпискиДоговоров.Удалить(ВыбранныйЭлемент);
		
		ОбновитьСписокВыбораПреддставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораПреддставленияСпискаДоговоров(СписокВыбора, СпискиДоговоров)
	
	СписокВыбора.Очистить();
	
	Для Каждого ЭлементСпискаДоговоров Из СпискиДоговоров Цикл
		СписокВыбора.Добавить(ЭлементСпискаДоговоров.ПолучитьИдентификатор(), ЭлементСпискаДоговоров.Представление); 
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьВРиски(Команда)
	ЗаголовокОшибки = "Ошибка выгрузки данных в базы Рисков";
	
	// Начало таблицы определяется по первой строке с текстом первой колонки табличного документа
	НомерСтрокиНачалаТаблицы = Неопределено;
	Для Итератор = 1 По 100 Цикл
		Если Не ПустаяСтрока(Результат.Область(Итератор, 1).Текст) Тогда
			НомерСтрокиНачалаТаблицы = Итератор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НомерСтрокиНачалаТаблицы = Неопределено Тогда
		ТекстОшибки = "Не найдено начало основной таблицы отчёта." + Символы.ПС
			+ "Нужно сформировать отчёт, если он не был сформирован.";
		ПоказатьПредупреждение(, ТекстОшибки, , ЗаголовокОшибки);
		Возврат;
	КонецЕсли;
		
	// Конец таблицы определяется по ячейке "ИТОГО:" первой колонки табличного документа,
	//	либо по первой пустой строке первой колонки в случаях, когда в таблице нет итогов.
	ИскомыйТекстЯчейки =
		?(Отчет.ВариантОтчета = "РасчетДоходностиДУ", "ИТОГО:",
		?(Отчет.ВариантОтчета = "ОбязательстваПередКлиентами", "", ""));
	НомерСтрокиКонцаТаблицы = Неопределено; // Конец таблицы не включает в себя итоги
	Если Не ПустаяСтрока(ИскомыйТекстЯчейки) Тогда // Поиск в таблице с итогами
		ТекущаяОбласть = Результат.НайтиТекст(ИскомыйТекстЯчейки, , Результат.Область(, 1, , 1), Ложь, Истина, Истина);
		Если ТекущаяОбласть = Неопределено Тогда
			ТекстОшибки = "Не найден конец основной таблицы отчёта по выражению """ + ИскомыйТекстЯчейки + """ в первой колонке.";
			ПоказатьПредупреждение(, ТекстОшибки, , ЗаголовокОшибки);
			Возврат;
		КонецЕсли;
		НомерСтрокиКонцаТаблицы = ТекущаяОбласть.Верх - 1;
	Иначе // Поиск в таблице без итогов
		Счётчик = НомерСтрокиНачалаТаблицы + 1;
		Пока Не ПустаяСтрока(Результат.Область(Счётчик, 1).Текст) Цикл
			Счётчик = Счётчик + 1;
		КонецЦикла;
		НомерСтрокиКонцаТаблицы = Счётчик - 1;
	КонецЕсли;
	Если НомерСтрокиНачалаТаблицы + 1 > НомерСтрокиКонцаТаблицы Тогда
		ТекстОшибки = "Таблица пустая или имеет неверный формат.";
		ПоказатьПредупреждение(, ТекстОшибки, , ЗаголовокОшибки);
		Возврат;
	КонецЕсли;
	
	// Колонка кодов клиентов определяется по заголовку столбца "Код ДУ"
	ИскомыйТекстЯчейки = "Код ДУ";
	ТекущаяОбласть = Результат.НайтиТекст(ИскомыйТекстЯчейки, , Результат.Область(НомерСтрокиНачалаТаблицы, , НомерСтрокиНачалаТаблицы), Ложь, Истина, Истина);
	Если ТекущаяОбласть = Неопределено Тогда
		ТекстОшибки = "Не найден заголовок столбца """ + ИскомыйТекстЯчейки + """ для получения списка кодов клиентов.";
		ПоказатьПредупреждение(, ТекстОшибки, , ЗаголовокОшибки);
		Возврат;
	КонецЕсли;
	НомерКолонкиКодовКлиентов = ТекущаяОбласть.Лево;
	
	// Колонка значений определяется по заголовку столбца:
	//	Для варианта отчёта "РасчетДоходностиДУ": "Эффективная доходность с начала года"
	//	Для варианта отчёта "ОбязательстваПередКлиентами": "Обязательства"
	ИскомыйТекстЯчейки =
		?(Отчет.ВариантОтчета = "РасчетДоходностиДУ", "Эффективная доходность с начала года",
		?(Отчет.ВариантОтчета = "ОбязательстваПередКлиентами", "Обязательства", ""));
	ТекущаяОбласть = Результат.НайтиТекст(ИскомыйТекстЯчейки, , Результат.Область(НомерСтрокиНачалаТаблицы, , НомерСтрокиНачалаТаблицы), Ложь, Истина, Истина);
	Если ТекущаяОбласть = Неопределено Тогда
		ТекстОшибки = "Не найден заголовок столбца """ + ИскомыйТекстЯчейки + """ для получения списка значений.";
		ПоказатьПредупреждение(, ТекстОшибки, , ЗаголовокОшибки);
		Возврат;
	КонецЕсли;
	НомерКолонкиЗначений = ТекущаяОбласть.Лево;
	
	// Для поиска кодов клиентов в таблице с группировкой нужно понимать, какие строки находятся на последнем уровне.
	//	Строки последнего уровня - это скрытые строки при группировке предпоследнего уровня.
	//	Для варианта отчёта "РасчетДоходностиДУ" настраиваемый уровень группировки и нужно его вычислить.
	//	Для варианта отчёта "ОбязательстваПередКлиентами" уровень группировки всегда 1.
	ИспользуютсяРазныеУровниГруппировки =
		?(Отчет.ВариантОтчета = "РасчетДоходностиДУ", Истина,
		?(Отчет.ВариантОтчета = "ОбязательстваПередКлиентами", Ложь, Ложь));
	УровнейГруппировки = 0;
	ЕстьГруппировки = Ложь;
	Если ИспользуютсяРазныеУровниГруппировки Тогда
		Для Каждого ГруппировкаОтчета Из Отчет.ГруппировкиОтчета Цикл
			Если ГруппировкаОтчета.Пометка Тогда
				УровнейГруппировки = УровнейГруппировки + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе // Для отчётов с фиксированным уровнем группировки его нужно указать
		Если Отчет.ВариантОтчета = "ОбязательстваПередКлиентами" Тогда
			УровнейГруппировки = 1;
		КонецЕсли;
	КонецЕсли;
	
	ЕстьГруппировки = УровнейГруппировки > 0;
	Если ЕстьГруппировки Тогда
		Результат.ПоказатьУровеньГруппировокСтрок(УровнейГруппировки - 1);
	КонецЕсли;
	
	// Получение значений из табличного документа
	ЗначенияПоКодамКлиентов = Новый Соответствие; // Соответствие(Строка, Число)
	Для Итератор = НомерСтрокиНачалаТаблицы + 1 По НомерСтрокиКонцаТаблицы Цикл
		Если ЕстьГруппировки И Результат.Область(Итератор, НомерКолонкиКодовКлиентов).Видимость Тогда
			Продолжить;
		КонецЕсли;
		ЧисловоеЗначение = 0;
		Попытка
			ЧисловоеЗначение = Число(Результат.Область(Итератор, НомерКолонкиЗначений).Текст);
		Исключение
		КонецПопытки;
		ЗначенияПоКодамКлиентов.Вставить(Результат.Область(Итератор, НомерКолонкиКодовКлиентов).Текст, ЧисловоеЗначение);
	КонецЦикла;
	
	Результат.ПоказатьУровеньГруппировокСтрок(УровнейГруппировки);
	
	// Открытие формы экспорта данных в базы Рисков
	КоллекцияДанных = Новый Массив;
	Для Каждого КлючЗначение Из ЗначенияПоКодамКлиентов Цикл
		ТекущаяСтруктура = Новый Структура;
		ТекущаяСтруктура.Вставить("КодКлиента", КлючЗначение.Ключ);
		Если Отчет.ВариантОтчета = "РасчетДоходностиДУ" Тогда
			ТекущаяСтруктура.Вставить("ДостигнутаяДоходность", КлючЗначение.Значение);
		ИначеЕсли Отчет.ВариантОтчета = "ОбязательстваПередКлиентами" Тогда
			ТекущаяСтруктура.Вставить("ОбязательстваПередКлиентом", КлючЗначение.Значение);
		КонецЕсли;
		КоллекцияДанных.Добавить(ТекущаяСтруктура);
	КонецЦикла;
	
	ПараметрыОткрываемойФормы = Новый Структура;
	ПараметрыОткрываемойФормы.Вставить("Организация", Отчет.Организация);
	ПараметрыОткрываемойФормы.Вставить("ТипЭкспорта",
		?(Отчет.ВариантОтчета = "РасчетДоходностиДУ", "ДостигнутаяДоходность",
		?(Отчет.ВариантОтчета = "ОбязательстваПередКлиентами", "ОбязательстваПередКлиентом", "")));
	ПараметрыОткрываемойФормы.Вставить("НачалоПериода", НачалоГода(Отчет.Период));
	ПараметрыОткрываемойФормы.Вставить("КонецПериода", Отчет.Период);
	ПараметрыОткрываемойФормы.Вставить("КоллекцияДанных", КоллекцияДанных);
	ОткрытьФорму("ВнешнийОтчет._РасчетДоходностиДУ.Форма.ВыгрузкаВРиски", ПараметрыОткрываемойФормы, ЭтаФорма); //РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
КонецПроцедуры
